<template>
  <div class="page-title">Новости оркестра</div>
  <div class="news-grid mt-10">
    <!-- большая карточка -->
    <news-preview-component
      :news-object="news[0]"
      class="news-item large"
      large
    />

    <!-- маленькие -->
    <news-preview-component
      v-for="newsObj in news.slice(1)"
      :key="newsObj.id"
      :news-object="newsObj"
      class="news-item small"
    />
  </div>

</template>

<script setup lang="ts">
import {onMounted} from "vue";
import NewsPreviewComponent from "./NewsPreviewComponent.vue";
import {News} from "@models/News";

onMounted(() => {
  window.scrollTo(0, 0);
});

const news: News[] = [
  {
    id: 0,
    title: 'Оркестр Политеха ждет в свои ряды новых музыкантов',
    description: 'Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов ',
    date: new Date('2025-08-28'),
    photoSrc: '/photos/main-page/banner/2.jpg',
  },
  {
    id: 1,
    title: 'Оркестр Политеха ждет в свои ряды новых музыкантов ',
    description: 'Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов ',
    date: new Date('2025-08-15'),
    photoSrc: '/photos/main-page/banner/2.jpg',
  },
  {
    id: 2,
    title: 'Оркестр Политеха ждет в свои ряды новых музыкантов ',
    description: 'Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов ',
    date: new Date('2025-08-11'),
    photoSrc: '/photos/main-page/banner/2.jpg',
  },
  {
    id: 3,
    title: 'Оркестр Политеха ждет в свои ряды новых музыкантов ',
    description: 'Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов ',
    date: new Date('2025-08-11'),
    photoSrc: '/photos/main-page/banner/2.jpg',
  },
  {
    id: 4,
    title: 'Оркестр Политеха ждет в свои ряды новых музыкантов ',
    description: 'Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов ',
    date: new Date('2025-08-11'),
    photoSrc: '/photos/main-page/banner/2.jpg',
  },
  {
    id: 5,
    title: 'Оркестр Политеха ждет в свои ряды новых музыкантов ',
    description: 'Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов Оркестр Политеха ждет в свои ряды новых музыкантов ',
    date: new Date('2025-08-11'),
    photoSrc: '/photos/main-page/banner/2.jpg',
  },
]
</script>

<style scoped>
.news-grid {
  display: grid;
  grid-template-columns: repeat(3, 1fr);
  grid-auto-columns: 50px;
  grid-auto-rows: 350px;
  gap: 50px;
}

.news-item.large {
  grid-column: span 2;
  grid-row: span 2;
}
</style>
