<template>
  <div>
    <v-row>
      <v-col>
        <h1>История Оркестра Политеха "INGENIUM"</h1>
        <p class="text-left darker-green-text mb-3">
          Первый студенческий оркестр из числа будущей инженерной элиты страны был создан в университете в начале XX века,
          однако, к сожалению, его летопись была краткой.
        </p>
        <p class="text-left darker-green-text">
          После долгого перерыва, в 2013 году, сообщество музыкантов было возрождено под руководством дирижера Дмитрия
          Владимировича Мисюры, а затем, в 2016 году, был дан первый сольный концерт на сцене Белого Зала СПбПУ
        </p>
      </v-col>
      <v-col>
        <v-img
          class="photo-cube"
          src="photos/history/1.jpg"
        />
      </v-col>
    </v-row>
    <v-row class="my-5">
      <v-col>
        <v-img
          class="photo-cube"
          src="photos/history/2.jpg"
        />
      </v-col>
      <v-col>
        <p class="text-left darker-green-text mb-3">
          Первый студенческий оркестр из числа будущей инженерной элиты страны был создан в университете в начале XX века,
          однако, к сожалению, его летопись была краткой.
        </p>
        <p class="text-left darker-green-text">
          После долгого перерыва, в 2013 году, сообщество музыкантов было возрождено под руководством дирижера Дмитрия
          Владимировича Мисюры, а затем, в 2016 году, был дан первый сольный концерт на сцене Белого Зала СПбПУ
        </p>
        <p class="text-left darker-green-text mb-3">
          Первый студенческий оркестр из числа будущей инженерной элиты страны был создан в университете в начале XX века,
          однако, к сожалению, его летопись была краткой.
        </p>
        <p class="text-left darker-green-text">
          После долгого перерыва, в 2013 году, сообщество музыкантов было возрождено под руководством дирижера Дмитрия
          Владимировича Мисюры, а затем, в 2016 году, был дан первый сольный концерт на сцене Белого Зала СПбПУ
        </p>
      </v-col>
    </v-row>
    <v-row class="my-5">
      <v-col>
        <p class="text-left darker-green-text mb-3">
          Первый студенческий оркестр из числа будущей инженерной элиты страны был создан в университете в начале XX века,
          однако, к сожалению, его летопись была краткой.
        </p>
        <p class="text-left darker-green-text">
          После долгого перерыва, в 2013 году, сообщество музыкантов было возрождено под руководством дирижера Дмитрия
          Владимировича Мисюры, а затем, в 2016 году, был дан первый сольный концерт на сцене Белого Зала СПбПУ
        </p>
        <p class="text-left darker-green-text mb-3">
          Первый студенческий оркестр из числа будущей инженерной элиты страны был создан в университете в начале XX века,
          однако, к сожалению, его летопись была краткой.
        </p>
        <p class="text-left darker-green-text">
          После долгого перерыва, в 2013 году, сообщество музыкантов было возрождено под руководством дирижера Дмитрия
          Владимировича Мисюры, а затем, в 2016 году, был дан первый сольный концерт на сцене Белого Зала СПбПУ
        </p>
      </v-col>
      <v-col>
        <v-img
          class="photo-cube"
          src="photos/history/3.jpg"
        />
      </v-col>
    </v-row>
  </div>
</template>

<style scoped lang="scss">

</style>
<script setup lang="ts">
</script>
